edwinm/esp32-terminal/sdkconfig.defaults
# Makerfabs ESP32-S3 Parallel TFT 3.5" (N16R2) — ESP-IDF 5.5.x defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, quad (QIO), 80 MHz ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 2 MB embedded QUAD (WROOM-1-N16R2) — NOT octal ---
# Nothing needs PSRAM today; it stays on because scrollback will live there.
# Note CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL below: plain malloc() sends
# allocations above that size to PSRAM, so DMA buffers use heap_caps_malloc()
# with MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL explicitly rather than by luck.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# --- CPU / performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# --- Console + flashing stay on UART0 (CP2104). The native USB-OTG port is
#     the terminal link (CDC-ACM), so IDF logs never pollute the terminal. ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- TinyUSB: one CDC-ACM interface on the native USB-OTG port ---
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=4096
CONFIG_TINYUSB_CDC_TX_BUFSIZE=2048
CONFIG_TINYUSB_CDC_EP_BUFSIZE=8192
# The descriptor strings (including a MAC-derived serial) are supplied in
# io/usb_cdc.c, so the CONFIG_TINYUSB_DESC_* defaults here are not used.

# --- Main task stack (display + terminal bring-up happens here) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
